<a href="https://colab.research.google.com/github/nadireus/Data-Analysis-with-Pandas/blob/main/Data_Analysis_with_Pandas3.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1><span style="text-align: center;">Pandas Lesson, Session - 6</span><h1>

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
#%matplotlib inline

# recap for Apply - Transform - Map

In [ ]:
np.random.seed(42)
df3 = pd.DataFrame(  np.random.randn(5,4), 
                   index = ['A', 'B', 'C', 'D', 'E'], 
                   columns = 'W X Y Z'.split()          )
df3

          W         X         Y         Z
A  0.496714 -0.138264  0.647689  1.523030
B -0.234153 -0.234137  1.579213  0.767435
C -0.469474  0.542560 -0.463418 -0.465730
D  0.241962 -1.913280 -1.724918 -0.562288
E -1.012831  0.314247 -0.908024 -1.412304

In [2]:
df6 = pd.DataFrame({'groups': ['A', 'B', 'C', 'A', 'B', 'C','A', 'B', 'C'],
                   'var1': [10,23,33,22,11,99,40,20,15],
                   'var2': [100,253,333,262,111,969, 232,343,123]})
df6

  groups  var1  var2
0      A    10   100
1      B    23   253
2      C    33   333
3      A    22   262
4      B    11   111
5      C    99   969
6      A    40   232
7      B    20   343
8      C    15   123

In [25]:
df6[["var1"]].transform(lambda x : (x-x.min())/(x.max()-x.min()))

       var1
0  0.000000
1  0.146067
2  0.258427
3  0.134831
4  0.011236
5  1.000000
6  0.337079
7  0.112360
8  0.056180

In [26]:
 df6[["var1"]].transform(lambda x : ( x - df6["var1"].min() )/
                                       (df6["var1"].max()-df6["var1"].min())
                       ) # make minmaxscaler

       var1
0  0.000000
1  0.146067
2  0.258427
3  0.134831
4  0.011236
5  1.000000
6  0.337079
7  0.112360
8  0.056180

In [20]:
df6[["var1","var2"]].apply(lambda x : (x-x.min())/(x.max()-x.min()))

       var1      var2
0  0.000000  0.000000
1  0.146067  0.176064
2  0.258427  0.268124
3  0.134831  0.186421
4  0.011236  0.012658
5  1.000000  1.000000
6  0.337079  0.151899
7  0.112360  0.279632
8  0.056180  0.026467

In [89]:
#'(lambda x : ( x - (df6["var1","var2"].min())) /((df6["var1","var2"].max())-(df6["var1","var2"].min())) # make minmaxscaler

In [31]:
df6.groupby('groups')[["var1","var2"]].transform(np.mean)

   var1        var2
0  24.0  198.000000
1  18.0  235.666667
2  49.0  475.000000
3  24.0  198.000000
4  18.0  235.666667
5  49.0  475.000000
6  24.0  198.000000
7  18.0  235.666667
8  49.0  475.000000

In [32]:
df6.groupby('groups')[["var1","var2"]].apply(np.mean)

        var1        var2
groups
A       24.0  198.000000
B       18.0  235.666667
C       49.0  475.000000

In [33]:
df6.groupby('groups')[["var1","var2"]].mean()

        var1        var2
groups
A       24.0  198.000000
B       18.0  235.666667
C       49.0  475.000000

In [48]:
df6.groupby('groups')[["var1","var2"]].transform('sum')

   var1  var2
0    72   594
1    54   707
2   147  1425
3    72   594
4    54   707
5   147  1425
6    72   594
7    54   707
8   147  1425

In [51]:
df6.groupby("groups").filter(lambda x : x["var2"].mean() > 200).groupby("groups").mean()

        var1        var2
groups
B       18.0  235.666667
C       49.0  475.000000

In [86]:
 #df6[["var1","var2"]].transform('sum')

In [87]:
df6["groups"].map({"A":"adam","B":"bruce","C":"cobweb"}) # use replace

0      adam
1     bruce
2    cobweb
3      adam
4     bruce
5    cobweb
6      adam
7     bruce
8    cobweb
Name: groups, dtype: object

In [88]:
df6["groups"].replace({"A":"adam","B":"bruce","C":"cobweb"})

0      adam
1     bruce
2    cobweb
3      adam
4     bruce
5    cobweb
6      adam
7     bruce
8    cobweb
Name: groups, dtype: object

# pivot table

In [52]:
titanic = sns.load_dataset('titanic')
titanic                                  #

     survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0           0       3    male  22.0  ...   NaN  Southampton     no  False
1           1       1  female  38.0  ...     C    Cherbourg    yes  False
2           1       3  female  26.0  ...   NaN  Southampton    yes   True
3           1       1  female  35.0  ...     C  Southampton    yes  False
4           0       3    male  35.0  ...   NaN  Southampton     no   True
..        ...     ...     ...   ...  ...   ...          ...    ...    ...
886         0       2    male  27.0  ...   NaN  Southampton     no   True
887         1       1  female  19.0  ...     B  Southampton    yes   True
888         0       3  female   NaN  ...   NaN  Southampton     no  False
889         1       1    male  26.0  ...     C    Cherbourg    yes   True
890         0       3    male  32.0  ...   NaN   Queenstown     no   True

[891 rows x 15 columns]

In [53]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.6+ KB

In [54]:
type(titanic)

pandas.core.frame.DataFrame

In [56]:
titanic.groupby(["sex","pclass"])[["survived"]].mean()

               survived
sex    pclass
female 1       0.968085
       2       0.921053
       3       0.500000
male   1       0.368852
       2       0.157407
       3       0.135447

In [57]:
titanic.pivot_table(values="survived", index="sex",columns="pclass")

pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [58]:
titanic.groupby(["sex","pclass"])[["survived"]].mean().unstack()

        survived
pclass         1         2         3
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [61]:
titanic.groupby(["who","sex","pclass"])[["survived"]].mean().unstack()

              survived
pclass               1         2         3
who   sex
child female  0.666667  1.000000  0.533333
      male    1.000000  1.000000  0.321429
man   male    0.352941  0.080808  0.119122
woman female  0.978022  0.909091  0.491228

In [60]:
titanic.groupby(["who","sex","pclass"])[["survived"]].mean().unstack().unstack()

        survived
pclass         1                   2                   3
sex       female      male    female      male    female      male
who
child   0.666667  1.000000  1.000000  1.000000  0.533333  0.321429
man          NaN  0.352941       NaN  0.080808       NaN  0.119122
woman   0.978022       NaN  0.909091       NaN  0.491228       NaN

In [62]:
titanic.pivot_table(values="survived", index=["sex","who"],columns="pclass",aggfunc="count")

pclass          1   2    3
sex    who
female child    3  10   30
       woman   91  66  114
male   child    3   9   28
       man    119  99  319

In [63]:
titanic.groupby(["who","sex","pclass"])[["survived"]].mean().stack()

who    sex     pclass
child  female  1       survived    0.666667
               2       survived    1.000000
               3       survived    0.533333
       male    1       survived    1.000000
               2       survived    1.000000
               3       survived    0.321429
man    male    1       survived    0.352941
               2       survived    0.080808
               3       survived    0.119122
woman  female  1       survived    0.978022
               2       survived    0.909091
               3       survived    0.491228
dtype: float64

In [64]:
df = pd.DataFrame({'A':[1, 2, np.nan],
                  'B':[5, np.nan, np.nan],
                  'C':[1, 2, 3]})

In [65]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [66]:
df.notnull()

       A      B     C
0   True   True  True
1   True  False  True
2  False  False  True

In [67]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [69]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [70]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [71]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [75]:
df2=df.append([[np.nan]]).reset_index(drop =True)
df2

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN
3  NaN  NaN  NaN NaN

In [76]:
df2.dropna()

Empty DataFrame
Columns: [A, B, C, 0]
Index: []

In [77]:
df2.dropna(how="all")

     A    B    C   0
0  1.0  5.0  1.0 NaN
1  2.0  NaN  2.0 NaN
2  NaN  NaN  3.0 NaN

In [80]:
df2.dropna(thresh=2, axis=1)

     A    C
0  1.0  1.0
1  2.0  2.0
2  NaN  3.0
3  NaN  NaN

In [83]:
df2.notnull()

       A      B      C      0
0   True   True   True  False
1   True  False   True  False
2  False  False   True  False
3  False  False  False  False

In [84]:
df.fillna(df.sum())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  3.0  5.0  3

In [85]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3